import {LOCALES} from "../constants";

export default {
    [LOCALES.RUSSIAN]: {
        "navbar": {
            "home": "Главная",
            "worldCup": "Чемпионат мира 2022",
            "matches": "Матчи",
            "leagues": {
                "tournaments": "Туринры",
                "allTournaments": "Все турниры",
            },
            "members": {
                "members": "Участники",
                "tournamentMembers": "Участиники турниров",
                "teams": "Команды",
                "players": "Игроки",
            },
            "contact": "Связаться с нами",
            "lang": "Выбирите язык",
        },
        "subheader": {
            "leagueMatches": "Матчи Лиги",
            "members": {
                "teams": "Участвующие команды: ",
                "players": "Участвующие игроки: ",
                "aboutPlayer": "Про игрока",
                "aboutTeam": "Про команду",
            },
            "matchDetails": "Детали матча",
            "round": "Тур",
        },
        "NotFound": {
            "message": "Извините, страница которую вы пытаетесь найти не существует.",
            "redirect": "Вернуться на главную.",
        },
        "footer": {
            "info": {
                "followUs": "Следите за нами",
                "leagueLinks": {
                    "title": "Ссылки на лиги",
                    "worldCup": "ЧЕМПИОНАТ МИРА 2022",
                    "results": "РЕЗУЛЬТАТЫ ТУРОВ",
                    "tournaments": "ТУРНИРЫ",
                    "players": "ИГРОКИ",
                    "contacts": "СВЯЗАТЬСЯ С НАМИ",
                }
            },
            "main": {
                "home": "Главная",
                "matches": "Матчи",
                "members": "Участники",
            }
        },
        "worldCup": {
            "title": "ЧЕМПИОНАТ МИРА 2022",
            "info": {
                "start": {
                    "title": "Старт",
                    "subtitle": "Сен 9"
                },
                "end": {
                    "title": "Конец",
                    "subtitle": "Дек 9",
                },
                "format": {
                    "title": "Формат",
                    "subtitle": "7 на 7",
                },
                "gender": {
                    "title": "Пол",
                    "subtitle": "Мужской"
                },
                "groups": {
                    "title": "Группы",
                    "subtitle": "8 x 2"
                },
                "infoText1": "Набор команд и игроков на чемпионат мира 2022 открыт, регистрируйте свою команду нажав на кнопку ниже - ",
                "infoText2": "Если вы хоиите присоединиться уже к участвующей команде, свяжитесь с нами через форму или напишите нам в WhatsApp."
            },
            "regulations": {
                "title": "РЕГЛАМЕНТ ТУРНИРА",
                "1": "2 тайма по 25 мин (перерыв 5 мин) Время \"грязное\" по табло, последняя минута каждого из таймов - \"чистое\" время На розыгрыш любого стандартного положения отводится 5 сек (иначе мяч передается сопернику) В случае ничейного результата (Play off) назначается 2 тайма по 10 мин. Если и так победитель не определен - серия пенальти по 3 удара. В каждом из таймов ведется подсчет фолов (6-ой фол и все последующие наказываются пробитием пенальти)",
                "2": "Красная карточка игроку - удаления с поля, команда остается в меньшестве на 2 минуты или до забитого гола, игрок получивший красную карточку не может продолжать данный матч.",
                "3": "На турнире будут использоваться электронные табло, а так же все матчи будут сниматься на новейшие видео камеры VEO. Будет вестись полная статистика, награждаться лучшие голы и футболисты.",
                "4": "Так же фолом команде карается не спортивное поведение, споры с арбитром (на усмотрение арбитра), а так же действует правило отложенного фола.",
                "5": "На каждой игре будет присутствовать делегат матча. В его обязанности будет входить помощь арбитру в спорных ситуациях (окончательное решение за арбитром матча), так же ведение статистики матча и соблюдение временных рамок.",
                "6": "Замены производятся строго возле скамейки запасных своей команды (без согласования с арбитром)",
                "7": "Перед каждым матчем заполняется заявка команды. Каждый игрок будет иметь карточку участника чемпионата.",
                "8": "В заявке на турнир может быть до 15 человек (допускается участие 3-х представителей другой национальности).",
                "9": "Каждая команда должна иметь игровую форму."
            },
            "groups": {
                "title": "КОМАНДЫ ПРИНИМАЮЩИЕ УЧАСТИЕ В ТУРНИРЕ И СОГЛАШЕНИЕ НА РЕГЛАМЕНТ",
                "group": "Группа"
            }
        },

        "buttons": {
            "registerNow": "Зарегистрируйтесь сейчас"
        }
    }
}